Autodesk.Revit.DB.ImportInstance.Create(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.View,Autodesk.Revit.DB.ExternalResourceReference,Autodesk.Revit.DB.SKPImportOptions,Autodesk.Revit.DB.LinkLoadResult@)
Creates a new instance of SKP link type from an external resource reference
and loads the linked file.
Remarks:
This function creates a new SKP link type as well as a new instance of this SKP link type.
The new instance of SKP link type is returned by this function and the element id of the new SKP link type
is contained in the LinkLoadResult.
If the given external resource reference of the SKP link is already used by an existing SKP link type,
a new instance of this existing SKP link type is created and returned. The element id of the existing
SKP link type is contained in the LinkLoadResult.
This function regenerates the input document.
document:
The document in which to create the SAT link.
DBView:
The view into which the SKP link will be created.
resourceReference:
The external resource reference describing the source of the SKP link.
options:
Various import options applicable to the SKP format.
If null, all options will be set to their respective default values.
linkLoadResult:
An object containing the results of creating and loading
the SKP link. It contains the ElementId of the new created SKP link type.
Returns:
The new instance of SKP link type created.
Throws Autodesk.Revit.Exceptions.ArgumentException:
document has is in an edit mode or is in family mode.
-or-
Import is temporarily disabled.
-or-
The view is not printable.
-or-
ThisViewOnly cannot be true when importing a DWG|DGN drawing into a 3D view
-or-
One or more strings describing layer selection is invalid or empty.
-or-
The scale is not valid as a CustomScale for use during import.
-or-
The server referenced by the ExternalResourceReference does not exist or
does not implement IExternalResourceServer.
-or-
The server referenced by the ExternalResourceReference cannot support CAD links.
-or-
The ExternalResourceReference (resourceReference) is not in a format
that is supported by its server.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Throws Autodesk.Revit.Exceptions.OptionalFunctionalityNotAvailableException:
The SKP Import/Link module is not available in the installed Revit.
Since:
2018

Autodesk.Revit.DB.ImportInstance.Create(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.View,Autodesk.Revit.DB.ExternalResourceReference,Autodesk.Revit.DB.SATImportOptions,Autodesk.Revit.DB.LinkLoadResult@)
Creates a new instance of SAT link type from an external resource reference
and loads the linked file.
Remarks:
This function creates a new SAT link type as well as a new instance of this SAT link type.
The new instance of SAT link type is returned by this function and the element id of the new SAT link type
is contained in the LinkLoadResult.
If the given external resource reference of the DWG link is already used by an existing SAT link type,
a new instance of this existing SAT link type is created and returned. The element id of the existing
SAT link type is contained in the LinkLoadResult.
This function regenerates the input document.
document:
The document in which to create the SAT link.
DBView:
The view into which the SAT link will be created.
resourceReference:
The external resource reference describing the source of the DGN link.
options:
Various import options applicable to the SAT format.
If null, all options will be set to their respective default values.
linkLoadResult:
An object containing the results of creating and loading
the SAT link. It contains the ElementId of the new created SAT link type.
Returns:
The new instance of SAT link type created.
Throws Autodesk.Revit.Exceptions.ArgumentException:
document has is in an edit mode or is in family mode.
-or-
Import is temporarily disabled.
-or-
The view is not printable.
-or-
ThisViewOnly cannot be true when importing a DWG|DGN drawing into a 3D view
-or-
One or more strings describing layer selection is invalid or empty.
-or-
The scale is not valid as a CustomScale for use during import.
-or-
The server referenced by the ExternalResourceReference does not exist or
does not implement IExternalResourceServer.
-or-
The server referenced by the ExternalResourceReference cannot support CAD links.
-or-
The ExternalResourceReference (resourceReference) is not in a format
that is supported by its server.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Throws Autodesk.Revit.Exceptions.OptionalFunctionalityNotAvailableException:
The SAT Import/Link module is not available in the installed Revit.
Since:
2018

Autodesk.Revit.DB.ImportInstance.Create(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.View,Autodesk.Revit.DB.ExternalResourceReference,Autodesk.Revit.DB.DGNImportOptions,Autodesk.Revit.DB.LinkLoadResult@)
Creates a new instance of DGN link type from an external resource reference
and loads the linked file.
Remarks:
This function creates a new DGN link type as well as a new instance of this DGN link type.
The new instance of DGN link type is returned by this function and the element id of the new DGN link type
is contained in the LinkLoadResult.
If the given external resource reference of the DWG link is already used by an existing DGN link type,
a new instance of this existing DGN link type is created and returned. The element id of the existing
DGN link type is contained in the LinkLoadResult.
This function regenerates the input document.
document:
The document in which to create the DGN link.
DBView:
The view into which the DGN link will be created.
resourceReference:
The external resource reference describing the source of the DGN link.
options:
Various import options applicable to the DGN format.
If null, all options will be set to their respective default values.
linkLoadResult:
An object containing the results of creating and loading
the DGN link. It contains the ElementId of the new created DGN link type.
Returns:
The new instance of DGN link type created.
Throws Autodesk.Revit.Exceptions.ArgumentException:
document has is in an edit mode or is in family mode.
-or-
Import is temporarily disabled.
-or-
The view is not printable.
-or-
ThisViewOnly cannot be true when importing a DWG|DGN drawing into a 3D view
-or-
One or more strings describing layer selection is invalid or empty.
-or-
The scale is not valid as a CustomScale for use during import.
-or-
The server referenced by the ExternalResourceReference does not exist or
does not implement IExternalResourceServer.
-or-
The server referenced by the ExternalResourceReference cannot support CAD links.
-or-
The ExternalResourceReference (resourceReference) is not in a format
that is supported by its server.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Throws Autodesk.Revit.Exceptions.OptionalFunctionalityNotAvailableException:
The DGN Import/Link module is not available in the installed Revit.
Since:
2018

Autodesk.Revit.DB.ImportInstance.Create(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.View)
Creates a new instance of an existing DWG link type.
Remarks:
This function regenerates the input document.
document:
The document in which to create the new instacne of DWG link type.
typeId:
The element id of the existing DWG link type.
DBView:
The view into which the new instance of DWG link type will be created.
Returns:
The new instance of the given DWG link type.
Throws Autodesk.Revit.Exceptions.ArgumentException:
document has is in an edit mode or is in family mode.
-or-
The view is not printable.
-or-
The element id is not of a valid CADLinkType.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Since:
2018

Autodesk.Revit.DB.ImportInstance.Create(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.View,Autodesk.Revit.DB.ExternalResourceReference,Autodesk.Revit.DB.DWGImportOptions,Autodesk.Revit.DB.LinkLoadResult@)
Creates a new instance of DWG link type from an external resource reference
and loads the linked file.
Remarks:
This function creates a new DWG link type as well as a new instance of this DWG link type.
The new instance of DWG link type is returned by this function and the element id of the new DWG link type
is contained in the LinkLoadResult.
If the given external resource reference of the DWG link is already used by an existing DWG link type,
a new instance of this existing DWG link type is created and returned. The element id of the existing
DWG link type is contained in the LinkLoadResult.
This function regenerates the input document.
document:
The document in which to create the DWG link.
DBView:
The view into which the DWG link will be created.
resourceReference:
The external resource reference describing the source of the DWG link.
options:
Various import options applicable to the DWG format.
If null, all options will be set to their respective default values.
linkLoadResult:
An object containing the results of creating and loading
the DWG link. It contains the ElementId of the new created DWG link type.
Returns:
The new instance of DWG link type created.
Throws Autodesk.Revit.Exceptions.ArgumentException:
document has is in an edit mode or is in family mode.
-or-
Import is temporarily disabled.
-or-
The view is not printable.
-or-
ThisViewOnly cannot be true when importing a DWG|DGN drawing into a 3D view
-or-
One or more strings describing layer selection is invalid or empty.
-or-
The array of line weights is not valid; either it contains less than expected 255 values, or one or more values are out of range 1 to 16
-or-
The scale is not valid as a CustomScale for use during import.
-or-
The server referenced by the ExternalResourceReference does not exist or
does not implement IExternalResourceServer.
-or-
The server referenced by the ExternalResourceReference cannot support CAD links.
-or-
The ExternalResourceReference (resourceReference) is not in a format
that is supported by its server.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Throws Autodesk.Revit.Exceptions.OptionalFunctionalityNotAvailableException:
The DWG Import/Link module is not available in the installed Revit.
Since:
2018

Autodesk.Revit.DB.ImportInstance.Create(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.View,System.String,Autodesk.Revit.DB.DWGImportOptions,Autodesk.Revit.DB.LinkLoadResult@)
Creates a new instance of DWG or DXF link type from a file path and loads the linked file.
Remarks:
This function creates a new DWG or DXF link type as well as a new instance of this link type.
The new instance of DWG or DXF link type is returned by this function and the element id of the new DWG
or DXF link type is contained in the LinkLoadResult.
If the given full path of the DWG or DXF file to link is already used by an existing DWG or DXF link type,
a new instance of this existing DWG or DXF link type will be created and returned. The element id of the existing
DWG or DXF link type is contained in the LinkLoadResult.
This function regenerates the input document.
document:
The document in which to create the DWG or DXF link.
DBView:
The view into which the DWG or DXF link will be created.
path:
The full path of the DWG or DXF file to link. The path must exist and must be a valid DWG or DXF file.
options:
Various import options applicable to the DWG format.
If null, all options will be set to their respective default values.
linkLoadResult:
An object containing the results of creating and loading
the DWG or DXF link. It contains the ElementId of the new created DWG or DXF link type.
Returns:
The new instance of DWG or DXF link type.
Throws Autodesk.Revit.Exceptions.ArgumentException:
document has is in an edit mode or is in family mode.
-or-
Import is temporarily disabled.
-or-
The view is not printable.
-or-
NullOrEmpty
-or-
Not a valid file for DWG import (.dwg and .dxf files are valid).
-or-
ThisViewOnly cannot be true when importing a DWG|DGN drawing into a 3D view
-or-
One or more strings describing layer selection is invalid or empty.
-or-
The array of line weights is not valid; either it contains less than expected 255 values, or one or more values are out of range 1 to 16
-or-
The scale is not valid as a CustomScale for use during import.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.FileArgumentNotFoundException:
The given path does not exist.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Place by shared, and the host model and the link do not share the same coordinate system.
Or place by shared, and the shared coordinates of the host model do not match the GIS coordinate system of the link.
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Throws Autodesk.Revit.Exceptions.OptionalFunctionalityNotAvailableException:
The DWG Import/Link module is not available in the installed Revit.
Since:
2018

Autodesk.Revit.DB.ImportInstance.IsLinked
Identifies whether this instance is a linked object rather than imported one.
Remarks:  True if the instance was imported as a link to an external file.
False if the instance was imported as a copy of data from an external file.
Since: 2011

Autodesk.Revit.DB.ImportInstance.SetVisibility(Autodesk.Revit.DB.FamilyElementVisibility)
Sets the visibility for the import instance in a family document.
Remarks: The visibility of the import instance geometry can be changed for different
types of views and detail levels in the family document.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
Thrown when visibility is null.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown when regeneration failed, or the import instance is in a project document.

Autodesk.Revit.DB.ImportInstance.GetVisibility
Gets the visibility for the import instance in a family document.
Returns: A copy of visibility settings for the import instance in a family document.

Autodesk.Revit.DB.ImportInstance
An element created during either import or link operation.
It is an instance of CADLinkType.